Documents/ЗаявкаНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаДоставку</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>авто_Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>авто_ТелефонВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительЗаберетГрузСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>Используется при программной проверке заполненности ОбработкаПроверкиЗаполнения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУлицы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплачиваетПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаДоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявокНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОтправленоСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УДАЛИТЬ_СтатусыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратНаДоставку</Name>
					<Comment>Себестоимость доставки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаДоставку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаявкаНаДоставку";
    КомандаПечати.Идентификатор = "НакладнаяНаДоставку";
    КомандаПечати.Представление = НСтр("ru = 'Накладная на доставку'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаДоставку") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НакладнаяНаДоставку", НСтр("ru = 'Накладная на доставку'"), ПечатьНакладнаяНаДоставку(МассивОбъектов, ОбъектыПечати), , "Документ.ЗаявкаНаДоставку.ПФ_MXL_Накладная");
    КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаДоставку.Ссылка,
	|	""01.01.2017"" КАК Дата,
	|	""01.01.2017"" КАК ДатаОснования,
	|	ЗаявкаНаДоставку.ВерсияДанных,
	|	ЗаявкаНаДоставку.ПометкаУдаления,
	|	ЗаявкаНаДоставку.Номер,
	|	ЗаявкаНаДоставку.Дата КАК ДатаДокумента,
	|	ЗаявкаНаДоставку.Проведен,
	|	ЗаявкаНаДоставку.СпособДоставки,
	|	ЗаявкаНаДоставку.АдресДоставки,
	|	ЗаявкаНаДоставку.Результат КАК ТекущийСтатус,
	|	ЗаявкаНаДоставку.ОтветственныйЗаДоставку,
	|	ЗаявкаНаДоставку.Организация,
	|	ЗаявкаНаДоставку.Автор,
	|	ЗаявкаНаДоставку.Комментарий,
	|	ЗаявкаНаДоставку.Экспедитор,
	|	ЗаявкаНаДоставку.Получатель,
	|	ВЫБОР КОГДА НЕ ЗаявкаНаДоставку.Получатель.НаименованиеПолное = """"
	|		ТОГДА
	|			ЗаявкаНаДоставку.Получатель.НаименованиеПолное
	|		ИНАЧЕ
	|			ЗаявкаНаДоставку.Получатель.Наименование
	|		КОНЕЦ КАК Контрагент,
	|	ЗаявкаНаДоставку.ОжидаемаяДатаДоставки,
	|	ЗаявкаНаДоставку.ОжидаемаяДатаОтправки,
	|	ЗаявкаНаДоставку.ОплачиваетПолучатель,
	|	ЗаявкаНаДоставку.СтоимостьДоставки,
	|	ЗаявкаНаДоставку.ТранспортноеСредство,
	|	ЗаявкаНаДоставку.Валюта,
	// №10663 |	ЗаявкаНаДоставку.Основание,
	|	ЗаявкаНаДоставку.ОтправленEMail,
	|	ЗаявкаНаДоставку.УДАЛИТЬ_ОтправленоСМС,
	|	ЗаявкаНаДоставку.НомерОтправления,
	|	ЗаявкаНаДоставку.авто_Модель,
	|	ЗаявкаНаДоставку.авто_Марка,
	|	ЗаявкаНаДоставку.авто_ГосНомер,
	|	ЗаявкаНаДоставку.авто_Водитель,
	|	ЗаявкаНаДоставку.авто_ТелефонВодителя,
	|	ЗаявкаНаДоставку.ВодительЗаберетГрузСамостоятельно,
	|	ЗаявкаНаДоставку.ОтправленоДата,
	|	ЗаявкаНаДоставку.ОтправленоОтветственный,
	|	ЗаявкаНаДоставку.ДоставленоДата,
	|	ЗаявкаНаДоставку.ДоставленоОтветственный
	//++ UPD: №10663 комментируем, т.к. основание теперь нужно выводить в колонке ТЧ "Товары"
	////++ №10663 комментируем, т.к. основание теперь в ТЧ
	////|	ЗаявкаНаДоставку.Основание.Дата КАК ДатаДокументаОснования,
	////|	ЗаявкаНаДоставку.Основание.Номер КАК НомерОснования
	//|	ЗаявкаНаДоставку.Основания.(
	//|		Основание
	//|	) КАК Основания,
	//|	ВЫРАЗИТЬ("""" Как Строка(150)) КАК ОснованияСтрокой
	////-- №10663
	|ИЗ
	|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	|ГДЕ
	|	ЗаявкаНаДоставку.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаДоставку.Ссылка,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Основание
	|ИЗ
	|	Документ.ЗаявкаНаДоставку.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
		
		//++ UPD: №10663 комментируем, т.к. основание теперь нужно выводить в колонке ТЧ "Товары"
		////++ №10663 адаптируем т.к. основание теперь в ТЧ
		////ТекущаяСтрока.ДатаОснования = Формат(ТекущаяСтрока.ДатаДокументаОснования,"ДЛФ=Д");
		////Попытка
		////	ТекущаяСтрока.НомерОснования = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.НомерОснования);
		////Исключение
		////КонецПопытки;
		//Для Каждого ТекущееОснование Из ТекущаяСтрока.Основания Цикл
		//	
		//	Попытка
		//		ОснованиеСтрокой = СтрШаблон("№%1 от %2"
		//			, ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущееОснование.Основание.Номер)
		//			, Формат(ТекущееОснование.Основание.Дата, "ДЛФ=Д")
		//		);
		//		ТекущаяСтрока.ОснованияСтрокой = ТекущаяСтрока.ОснованияСтрокой + ?(ЗначениеЗаполнено(ТекущаяСтрока.ОснованияСтрокой), ", ", "") + ОснованиеСтрокой;
		//	Исключение
		//	КонецПопытки;
		//	
		//КонецЦикла;
		//-- №10663
		
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Получатель);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьНакладнаяНаДоставку(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_НакладнаяНаДоставку";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаНаДоставку.ПФ_MXL_Накладная");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
    
    ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Получатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		//++ №10663 комментируем, т.к. основание теперь нужно выводить в колонке ТЧ "Товары"
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Основание");
		//	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение			
		//КонецПопытки;
		//-- №10663
		
		//добавим адрес доставки, если поле не пустое
		Попытка
			Если не ПустаяСтрока(ДанныеПечати.АдресДоставки) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("АдресДоставки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение			
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("СпособДоставки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		Если ДанныеПечати.СпособДоставки = Справочники.СпособыДоставкиТовара.Автобус
			или ДанныеПечати.СпособДоставки = Справочники.СпособыДоставкиТовара.ПопутныйАвтомобиль Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Автобус");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение			
			КонецПопытки;
		ИначеЕсли ДанныеПечати.СпособДоставки = Справочники.СпособыДоставкиТовара.СобственныйТранспорт Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("СобственныйТранспорт");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение			
			КонецПопытки;
		ИначеЕсли ДанныеПечати.СпособДоставки = Справочники.СпособыДоставкиТовара.ТранспортнаяКомпания Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ТранспортнаяКомпания");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение			
			КонецПопытки;
		КонецЕсли;
		
		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение			
		КонецПопытки;		
				
		Сумма = 0;
		Количество = 0;
		НомерСтроки = 1;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам.Сбросить();
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Попытка					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					
					//++ №12909
					//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
					ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);;
					//-- №12909
					
					ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
					
					//++ №10663 выводим основание из колонки в виде [ВидДокумента] [НомерДокументаНаПечать] от [ДатаДокумента]
					Попытка
						ОбластьМакета.Параметры.Основание = СтрШаблон("%1 №%2 от %3"
							, Выборка.Основание.Метаданные().Синоним
							, ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Основание.Номер)
							, Формат(Выборка.Основание.Дата, "ДЛФ=Д")
						);
					Исключение
					КонецПопытки;
					//-- №10663
					
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
					НомерСтроки = НомерСтроки + 1;			
					Количество = Количество + Выборка.Количество;
					Сумма = Сумма + Выборка.Сумма;
					
				Исключение			
				КонецПопытки;		
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.Отпустил = ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Организация.Руководитель.Наименование);									
			Исключение			
			КонецПопытки; 
			Попытка
				ОбластьМакета.Параметры.Количество = Количество;						
			Исключение			
			КонецПопытки;
			Попытка		
				ОбластьМакета.Параметры.Сумма = Сумма;			
			Исключение			
			КонецПопытки;		
			
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;

	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ИспользоватьЗаявкиНаРасходованиеДенежныхСредств = Константы.ИспользоватьЗаявкиНаРасходованиеДенежныхСредств.Получить();
	
	Если ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	Документы.ПоступлениеТоваровИУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Если Не ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команду создания документа "Заявка на доставку"
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ЗаявкаНаДоставку) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ЗаявкаНаДоставку.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.ЗаявкаНаДоставку.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "УчитыватьДоставкуТовара";	
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
